benchmark/k6/results/AWS_LoadTest_LargePL_2025-02-25T01:40:24.log
Execution Setup
{
  "testName": "AWS_LoadTest_LargePL",
  "host": "13.58.248.108",
  "options": {
    "insecureSkipTLSVerify": true,
    "stages": [
      {
        "duration": "2m",
        "target": 350
      },
      {
        "duration": "1m",
        "target": 350
      },
      {
        "duration": "2m",
        "target": 0
      }
    ]
  },
  "multiplier": 100,
  "text": "In an era defined by rapid innovation and global interconnectivity, humanity finds itself at the crossroads of technology and tradition. Modern advancements in computing, medicine, and environmental science have redefined possibilities, enabling breakthroughs once thought impossible. As digital networks weave communities together, ethical debates and sustainable practices emerge as critical priorities. Scholars, engineers, and policymakers collaborate to harness artificial intelligence and renewable energy, ensuring progress benefits society at large. Cultural heritage and scientific discovery now coexist in a delicate balance, challenging us to honor the past while forging new paths. Every discovery, from quantum computing to gene editing, invites both excitement and caution, urging responsible innovation and shared wisdom for a brighter future. With each milestone, the narrative of progress deepens, inspiring a commitment to knowledge, empathy, and perseverance that transcends borders and generations. This comprehensive journey through scientific and cultural evolution illustrates how collective effort and visionary thinking drive society forward. The integration of diverse perspectives fosters innovation, while respect for natural systems ensures that progress remains sustainable and inclusive. As challenges arise and new opportunities emerge, the interplay between technology and human values continues to shape our shared destiny, reminding us that every step forward is a testament to our capacity for adaptation and hope.",
  "sleep": 0
}

----------------------------------------

Running gRPC Auto Migration via Framework...
         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 
     execution: local
        script: grpc-auto-test.js
        output: -
     scenarios: (100.00%) 1 scenario, 350 max VUs, 5m30s max duration (incl. graceful stop):
              * default: Up to 350 looping VUs for 5m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)
     ✓ status is OK
     checks...............: 100.00% 6339 out of 6339
     data_received........: 985 MB  3.3 MB/s
     data_sent............: 13 MB   43 kB/s
     grpc_req_duration....: avg=7.98s  min=1.07s med=5.03s max=1m0s p(90)=17.02s p(95)=22.44s
     iteration_duration...: avg=10.22s min=1.6s  med=7.23s max=1m4s p(90)=19.89s p(95)=25.75s
     iterations...........: 6339    21.085383/s
     vus..................: 3       min=3            max=350
     vus_max..............: 350     min=350          max=350
----------------------------------------

Running gRPC Manual Migration...
         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 
     execution: local
        script: grpc-manual-test.js
        output: -
     scenarios: (100.00%) 1 scenario, 350 max VUs, 5m30s max duration (incl. graceful stop):
              * default: Up to 350 looping VUs for 5m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)
     ✗ status is OK
      ↳  99% — ✓ 5483 / ✗ 2
     checks...............: 99.96% 5483 out of 5485
     data_received........: 868 MB 2.6 MB/s
     data_sent............: 11 MB  35 kB/s
     grpc_req_duration....: avg=9.09s  min=1.1s  med=4.2s  max=1m58s p(90)=17.18s p(95)=30.56s
     iteration_duration...: avg=11.03s min=1.66s med=6.13s max=2m6s  p(90)=19.84s p(95)=33.58s
     iterations...........: 5485   16.705948/s
     vus..................: 1      min=1            max=350
     vus_max..............: 350    min=350          max=350
----------------------------------------

Running HTTP REST Existing API...
         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 
     execution: local
        script: http-test.js
        output: -
     scenarios: (100.00%) 1 scenario, 350 max VUs, 5m30s max duration (incl. graceful stop):
              * default: Up to 350 looping VUs for 5m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)
     ✗ status is 200
      ↳  77% — ✓ 1607 / ✗ 480
     checks.........................: 77.00% 1607 out of 2087
     data_received..................: 303 MB 1.0 MB/s
     data_sent......................: 3.7 MB 12 kB/s
     http_req_blocked...............: avg=565.56ms min=1.27µs   med=3.61µs  max=6.5s     p(90)=1.41s   p(95)=2.3s   
     http_req_connecting............: avg=565.54ms min=0s       med=0s      max=6.5s     p(90)=1.41s   p(95)=2.3s   
     http_req_duration..............: avg=30.58s   min=375.68ms med=27.38s  max=1m0s     p(90)=1m0s    p(95)=1m0s   
       { expected_response:true }...: avg=22.09s   min=375.68ms med=17.61s  max=59.99s   p(90)=48.28s  p(95)=53.5s  
     http_req_failed................: 22.99% 480 out of 2087
     http_req_receiving.............: avg=28.43s   min=0s       med=25.23s  max=59.15s   p(90)=57.29s  p(95)=58.62s 
     http_req_sending...............: avg=27.68µs  min=4.4µs    med=17.36µs max=255.59µs p(90)=57.97µs p(95)=68.15µs
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s      max=0s       p(90)=0s      p(95)=0s     
     http_req_waiting...............: avg=2.15s    min=290.33ms med=1.3s    max=58.79s   p(90)=4.64s   p(95)=5.5s   
     http_reqs......................: 2087   6.950065/s
     iteration_duration.............: avg=31.15s   min=375.82ms med=27.96s  max=1m0s     p(90)=1m0s    p(95)=1m0s   
     iterations.....................: 2087   6.950065/s
     vus............................: 2      min=2            max=350
     vus_max........................: 350    min=350          max=350
----------------------------------------

All tests completed. See 'results/AWS_LoadTest_LargePL_2025-02-25T01:40:24.log' for details.